tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "awscli"
brew "bat"
brew "btop"
brew "cask"
brew "cmatrix"
brew "exa"
brew "ffmpeg"
brew "fnm"
brew "fuzzy-find"
brew "jump"
# tapping the formula to get frequent updates
brew "jesseduffield/lazydocker/lazydocker"
brew "ghostscript"
brew "gifsicle"
brew "glow"
brew "libavif"
brew "lf"
brew "mas"
brew "fastfetch"
brew "neovim"
brew "ncdu"
brew "pyenv"
brew "ripgrep"
brew "ruby"
brew "rustup-init"
brew "tree"
brew "typst"
brew "wget"
brew "xclip"
brew "youtube-dl", args: ["HEAD"]
brew "zsh-vi-mode"

# General
cask "appcleaner"
cask "caffeine"
cask "codewhisperer"
cask "datagrip"
cask "docker"
cask "fig"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "alacritty"
cask "keycastr"
cask "logi-options-plus"
cask "openinterminal"
cask "rectangle"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoom"

# Work
cask "aws-vpn-client"
cask "loom"
cask "postman"
cask "slack"

# Personal
cask "1password"
cask "mactex-no-gui"
cask "telegram"
cask "temurin17"
cask "transmission"
cask "viber"
cask "vlc"
cask "whatsapp"
cask "whisky"

# VS Code Themes and Basics
vscode "AykutSarac.jsoncrack-vscode"
vscode "GitHub.github-vscode-theme"
vscode "bierner.markdown-mermaid"
vscode "davidbwaters.macos-modern-theme"
vscode "mechatroner.rainbow-csv"
vscode "nemesv.copy-file-name"
vscode "vscodevim.vim"
vscode "withfig.fig"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"

# Mac App Store Apps - General
mas "Dropover - Easier Drag & Drop", id: 1355679052
mas "Gapplin", id: 768053424
mas "Gifski", id: 1351639930
mas "SnippetsLab", id: 1006087419

# Mac App Store Apps - Personal
mas "AdBlock for Safari", id: 1402042596
mas "Messenger", id: 1480068668
mas "Twitter", id: 1482454543
mas "Vimari", id: 1480933944