# CLI Tools
brew "awscli"                            # AWS command line interface
brew "alloy-analyzer"                    # Alloy formal specification language and LSP
brew "bat"                               # cat with syntax highlighting
brew "bob"                               # Neovim version manager
brew "btop"                              # Resource monitor (CPU, memory, etc.)
brew "oven-sh/bun/bun"                   # JavaScript/TypeScript runtime (official tap)
brew "cloudflare-speed-cli"              # Internet speed test via Cloudflare
brew "chezmoi"                           # Manage your dotfiles across multiple machines
brew "colima"                            # Container runtime for Docker or Containerd
brew "docker"                            # Docker CLI (container platform)
brew "eza"                               # Modern alternative for ls
brew "fastfetch"                         # System information tool
brew "fd"                                # Modern alternative to find
brew "ffmpeg"                            # Video/audio converter and processor
brew "fnm"                               # Node.js version manager
brew "fzf"                               # Fuzzy finder, used to enhance history
brew "gdu"                               # Disk usage analyzer
brew "gh"                                # GitHub CLI
brew "gifsicle"                          # GIF image optimizer and editor
brew "glow"                              # Markdown renderer for the terminal
brew "go"                                # Go programming language
brew "googleworkspace-cli"               # Google Workspace CLI
brew "httpie"                            # User-friendly HTTP client
brew "jq"                                # JSON processor
brew "jump"                              # Quick directory navigation
brew "mas"                               # Mac App Store command line interface
brew "meson"                             # Build system
brew "opam"                              # OCaml package manager
brew "opencode"                          # AI coding CLI
brew "poetry"                            # Legacy Python packaging
brew "quint"                             # Quint formal specification language and LSP
brew "rbenv"                             # Ruby version manager
brew "ripgrep"                           # Modern alternative for grep
brew "shellcheck"                        # Shell script linter
brew "rsync"                             # File synchronization tool
brew "rustup"                            # Rust toolchain manager
brew "starship"                          # Shell prompt customization
brew "stylua"                            # Lua formatter
brew "typst"                             # Modern alternative to LaTeX
brew "typstyle"                          # Typst formatter
brew "uv"                                # Modern Python packaging
brew "wget"                              # File downloader
brew "yt-dlp"                            # Video downloader

# General
cask "appcleaner"                        # App uninstaller
cask "caffeine"                          # Prevent sleep
cask "chatgpt"                           # OpenAI ChatGPT desktop app
cask "claude"                            # Anthropic Claude desktop app
cask "discord"                           # Chat and voice
cask "font-jetbrains-mono-nerd-font"     # Nerd Font for terminal/editor
cask "gcloud-cli"                        # Google Cloud Platform CLI (gcloud)
cask "google-chrome"                     # Web browser
cask "google-drive"                      # Google Drive sync
cask "ghostty"                           # Terminal emulator
cask "keycastr"                          # Keystroke visualizer
cask "keymapp"                           # ZSA keyboard configurator
cask "logi-options-plus"                 # Logitech device manager
cask "openinterminal"                    # Open terminal from Finder
cask "rectangle"                         # Window management
cask "spotify"                           # Music streaming
cask "the-unarchiver"                    # Archive extraction
cask "zed"                               # Code editor
cask "zoom"                              # Video conferencing
cask "slack"                             # Team messaging

# Personal
cask "1password"                         # Password manager
cask "plex-media-server"                 # Media server
cask "telegram"                          # Messaging
cask "transmission"                      # BitTorrent client
cask "vlc"                               # Media player
cask "whatsapp"                          # Messaging
brew "gemini-cli"                        # Google Gemini CLI
brew "claude-code"                       # Anthropic Claude CLI
brew "netlify-cli"                       # Netlify deployment CLI

# Work
cask "datagrip"                          # JetBrains database IDE
brew "snowflake-cli"                     # Snowflake CLI

# Mac App Store Apps - General
mas "Dropover - Easier Drag & Drop", id: 1355679052
mas "Be Focused Pro", id: 961632517
mas "Gifski", id: 1351639930
mas "SnippetsLab", id: 1006087419
